In [4]:
import pandas as pd
import numpy as np
df = pd.read_csv("Churn_Modelling.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:
df[['Gender','Exited']].groupby('Gender').mean()

          Exited
Gender
Female  0.250715
Male    0.164559

In [7]:
df[['Gender','Exited']].groupby('Gender').agg(['mean','count'])

          Exited
            mean count
Gender
Female  0.250715  4543
Male    0.164559  5457

In [9]:
df[['Geography','Gender','Exited']].groupby(['Gender','Geography']).mean()

                    Exited
Gender Geography
Female France     0.203450
       Germany    0.375524
       Spain      0.212121
Male   France     0.127134
       Germany    0.278116
       Spain      0.131124

In [12]:
df[['Gender','Geography','Exited']].groupby(['Gender','Geography'],as_index=False).mean().sort_values(by='Exited', ascending=False)

   Gender Geography    Exited
1  Female   Germany  0.375524
4    Male   Germany  0.278116
2  Female     Spain  0.212121
0  Female    France  0.203450
5    Male     Spain  0.131124
3    Male    France  0.127134

In [25]:
df2 = df[['Geography','Age','Tenure']].groupby(['Geography'],as_index=False).agg(['mean','max']).reset_index()

In [28]:
list(map(''.join, df2.columns.values))

['Geography', 'Agemean', 'Agemax', 'Tenuremean', 'Tenuremax']

In [22]:
df2.columns = list(map(''.join, df2.columns.values))

In [24]:
df2.columns

Index(['Geography', 'Agemean', 'Agemax', 'Tenuremean', 'Tenuremax'], dtype='object')

In [33]:
df3 = df[['Exited','Geography','Age','Tenure']].groupby(['Exited','Geography']).agg(['mean','count']).sort_values(by=[('Age','mean')])

In [34]:

df3.columns = list(map(''.join, df3.columns.values))

In [41]:
df3.index

MultiIndex([(0,  'France'),
            (0, 'Germany'),
            (0,   'Spain'),
            (1,   'Spain'),
            (1, 'Germany'),
            (1,  'France')],
           names=['Exited', 'Geography'])

In [49]:
df3.loc[[(0,'Spain')]]

                    Agemean  Agecount  Tenuremean  Tenurecount
Exited Geography
0      Spain      37.839147      2064    5.107558         2064

In [50]:
df[['Geography','Exited']].groupby('Geography', dropna=False).agg(['mean','count'])

             Exited
               mean count
Geography
France     0.161548  5014
Germany    0.324432  2509
Spain      0.166734  2477